[{"answer":"derby","food":"Pickles and miso soup.","name":"Siouxper Nova"},{"answer":"pregnant","food":"Pickles dipped in mustard.","name":"Raq-hell on Wheels"},{"answer":"derby","comment":"After practice I'd go to Wendy's get fries and get a Frosty double","food":"Wendy's fries and a Frosty double","name":"Zooey Dash-in-hell"},{"answer":"pregnant","comment":"I ate everything. Lol I gained 80 pounds with my first and 90 with my second. So \"everything\" is my answer.","food":"Everything.","name":"Laura Kruger"},{"answer":"pregnant","comment":"Some find it strange that I had no cravings when pregnant with my twins, I would be so hungry but nothing sounded good. Not even ........beer o_o I was a complete stranger to even myself....","food":"I would be so hungry but nothing sounded good.","name":"Hoppe Go Lucky"},{"answer":"pregnant","food":"I craved chocolate milk, lemonade, kettle chips, and cheeseburgers most of all. And ice cream.","name":"Ironcide"},{"answer":"derby","comment":"Stopped at the store last night after practice to grab chocolate milk, because protein. I came out with chocolate milk, two kinds of cheese, and half a pound of smoked salmon. Because PROTEIN.","food":"Stopped at the store last night after practice to grab chocolate milk... I came out with chocolate milk, two kinds of cheese, and half a pound of smoked salmon.","name":"Critical Tits"},{"answer":"derby","food":"After the idea of chocolate milk was put into my head, I went and picked up chocolate milk...and caramel popcorn...and greek yogurt...and ice cream....and grape soda - but I only drank the milk. Lol!","name":"Zooey Dash-in-hell"},{"answer":"pregnant","food":"I drank a gallon of OJ every day and I craved the Chicken Strip basket with texas toast, fries, and gravy from Dairy Queen.","name":"Zooey Dash-in-hell"},{"answer":"pregnant","comment":"When I was pregnant, every day I ate egg salad over a bed of spinach with a side of ice cream.","food":"Every day I ate egg salad over a bed of spinach with a side of ice cream.","name":"Slyanide"},{"answer":"derby","comment":"After derby, I love to gorge on yogurt almonds. Or egg sandwiches with loads of sriracha.","food":"Gorge on yogurt almonds. Or egg sandwiches with loads of sriracha.","name":"Slyanide"},{"answer":"pregnant","food":"MILK! I drank milk with every meal.","name":"Megan McMahan"},{"answer":"pregnant","food":"Gummy bears, Cocoa Krispies, and ketchup which I do not usually enjoy.","name":"Camille Toad"},{"answer":"derby","food":"A general need to devour everything that surrounds me.","name":"HP Shovecraft"},{"answer":"pregnant","food":"Beef jerky, trail mix, shitty cheese pizza, and sherbet.","name":"Bettie Davis Thighs"},{"answer":"pregnant","food":"Overcooked green beans, tuna melts, and curried anything.","name":"CoffeeMugger"},{"answer":"derby","food":"Chocolate milk, Guiness, prime rib, bacon, and pancakes.","name":"Little Lebowski"}]